cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32GG980F512.svd
        <register>
          <name>IFS</name>
          <description>Interrupt Flag Set Register</description>
          <addressOffset>0x044</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FF9</resetMask>
          <fields>
            <field>
              <name>TXC</name>
              <description>Set TX Complete Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXFULL</name>
              <description>Set RX Buffer Full Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXOF</name>
              <description>Set RX Overflow Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXUF</name>
              <description>Set RX Underflow Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXOF</name>
              <description>Set TX Overflow Interrupt Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXUF</name>
              <description>Set TX Underflow Interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PERR</name>
              <description>Set Parity Error Interrupt Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FERR</name>
              <description>Set Framing Error Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MPAF</name>
              <description>Set Multi-Processor Address Frame Interrupt Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SSM</name>
              <description>Set Slave-Select in Master mode Interrupt Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CCF</name>
              <description>Set Collision Check Fail Interrupt Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFC</name>
          <description>Interrupt Flag Clear Register</description>
          <addressOffset>0x048</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FF9</resetMask>
          <fields>
            <field>
              <name>TXC</name>
              <description>Clear TX Complete Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXFULL</name>
              <description>Clear RX Buffer Full Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXOF</name>
              <description>Clear RX Overflow Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXUF</name>
              <description>Clear RX Underflow Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXOF</name>
              <description>Clear TX Overflow Interrupt Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXUF</name>
              <description>Clear TX Underflow Interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PERR</name>
              <description>Clear Parity Error Interrupt Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FERR</name>
              <description>Clear Framing Error Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MPAF</name>
              <description>Clear Multi-Processor Address Frame Interrupt Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SSM</name>
              <description>Clear Slave-Select In Master Mode Interrupt Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CCF</name>
              <description>Clear Collision Check Fail Interrupt Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x04C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <fields>
            <field>
              <name>TXC</name>
              <description>TX Complete Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBL</name>
              <description>TX Buffer Level Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDATAV</name>
              <description>RX Data Valid Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFULL</name>
              <description>RX Buffer Full Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXOF</name>
              <description>RX Overflow Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXUF</name>
              <description>RX Underflow Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXOF</name>
              <description>TX Overflow Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXUF</name>
              <description>TX Underflow Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERR</name>
              <description>Parity Error Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FERR</name>
              <description>Framing Error Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPAF</name>
              <description>Multi-Processor Address Frame Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSM</name>
              <description>Slave-Select In Master Mode Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCF</name>
              <description>Collision Check Fail Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRCTRL</name>
          <description>IrDA Control Register</description>
          <addressOffset>0x050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>IREN</name>
              <description>Enable IrDA Module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRPW</name>
              <description>IrDA TX Pulse Width</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>IrDA pulse width is 1/16 for OVS=0 and 1/8 for OVS=1</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>IrDA pulse width is 2/16 for OVS=0 and 2/8 for OVS=1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <description>IrDA pulse width is 3/16 for OVS=0 and 3/8 for OVS=1</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>IrDA pulse width is 4/16 for OVS=0 and 4/8 for OVS=1</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRFILT</name>
              <description>IrDA RX Filter</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRPRSSEL</name>
              <description>IrDA PRS Channel Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRSCH0</name>
                  <description>PRS Channel 0 selected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH1</name>
                  <description>PRS Channel 1 selected</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH2</name>
                  <description>PRS Channel 2 selected</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH3</name>
                  <description>PRS Channel 3 selected</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH4</name>
                  <description>PRS Channel 4 selected</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH5</name>
                  <description>PRS Channel 5 selected</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH6</name>
                  <description>PRS Channel 6 selected</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH7</name>
                  <description>PRS Channel 7 selected</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRPRSEN</name>
              <description>IrDA PRS Channel Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROUTE</name>
          <description>I/O Routing Register</description>
          <addressOffset>0x054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000070F</resetMask>
          <fields>
            <field>
              <name>RXPEN</name>
              <description>RX Pin Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPEN</name>
              <description>TX Pin Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSPEN</name>
              <description>CS Pin Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKPEN</name>
              <description>CLK Pin Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCATION</name>
              <description>I/O Location</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOC0</name>
                  <description>Location 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC1</name>
                  <description>Location 1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC2</name>
                  <description>Location 2</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC3</name>
                  <description>Location 3</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC4</name>
                  <description>Location 4</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC5</name>
                  <description>Location 5</description>
                  <value>0x00000005</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT</name>
          <description>USART Input Register</description>
          <addressOffset>0x058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>RXPRSSEL</name>
              <description>RX PRS Channel Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRSCH0</name>
                  <description>PRS Channel 0 selected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH1</name>
                  <description>PRS Channel 1 selected</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH2</name>
                  <description>PRS Channel 2 selected</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH3</name>
                  <description>PRS Channel 3 selected</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH4</name>
                  <description>PRS Channel 4 selected</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH5</name>
                  <description>PRS Channel 5 selected</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH6</name>
                  <description>PRS Channel 6 selected</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH7</name>
                  <description>PRS Channel 7 selected</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH8</name>
                  <description>PRS Channel 8 selected</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH9</name>
                  <description>PRS Channel 9 selected</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH10</name>
                  <description>PRS Channel 10 selected</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH11</name>
                  <description>PRS Channel 11 selected</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXPRS</name>
              <description>PRS RX Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
